Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase.FileName Property
 Gets or sets the file name defining the embedded object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string FileName { get; set; }
Public Property FileName As String
	Get
	Set
Property Value
Type: String
Remarks
A full path should be used because the application may not be running with the same working directory as Tekla Structures (usually using \TeklaStructuresModels\ModelName).
See Also
Reference
EmbeddedObjectBase Class
Tekla.Structures.Drawing Namespace